Revit 2024 API
ExportPatternKey Constructor (FillPatternTarget, String)
 Constructs a new ExportPatternKey using the original fill pattern type and name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportPatternKey(
	FillPatternTarget originalFillPatternType,
	string originalFillPatternName
)
Visual Basic
Public Sub New ( _
	originalFillPatternType As FillPatternTarget, _
	originalFillPatternName As String _
)
Visual C++
public:
ExportPatternKey(
	FillPatternTarget originalFillPatternType,
	String^ originalFillPatternName
)
Parameters
originalFillPatternType
Type: Autodesk.Revit.DB.FillPatternTarget
 The original FillPattern type.
originalFillPatternName
Type: System.String
 The original FillPattern name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace